tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
# General-purpose data compression with high compression ratio
brew "xz"
# Library to render SVG files using Cairo
brew "librsvg"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Ruby environment tool
brew "chruby"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Measure DNS performance by simulating network conditions
brew "dnsperf"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU database manager
brew "gdbm"
# GNOME text editor
brew "gedit"
# Distributed revision control system
brew "git"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Improved top (interactive process viewer)
brew "htop"
# Migrate or backup IMAP mail accounts
brew "imapsync"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@20", link: true
# Create, run, and share large language models (LLMs)
brew "ollama"
# Password generator
brew "pwgen"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# Additional completion definitions for zsh
brew "zsh-completions"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Chromium based browser
cask "arc"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
# GUI for the Dynamips Cisco router emulator
cask "gns3"
# Development environment
cask "hashicorp-vagrant"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File system integration
cask "macfuse"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Scan and remove malware, spyware, and viruses
cask "malwarebytes"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Centralises all remote connections on a single platform
cask "remote-desktop-manager"
# Remote access and connectivity software focused on security
cask "teamviewer"
# SSH client
cask "termius"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Development environment
cask "vagrant"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Rust-based terminal
cask "warp"
# Network protocol analyzer
cask "wireshark-app"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bbenoist.vagrant"
vscode "docker.docker"
vscode "gitpod.gitpod-flex"
vscode "hashicorp.terraform"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
