tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "netbirdio/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Library to render SVG files using Cairo
brew "librsvg"
# YAML Parser
brew "libyaml"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Parser generator
brew "bison"
# Ruby environment tool
brew "chruby"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU database manager
brew "gdbm"
# GNOME text editor
brew "gedit"
# Distributed revision control system
brew "git"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Improved top (interactive process viewer)
brew "htop"
# Portable Foreign Function Interface library
brew "libffi"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Split input and feed it into the given utility
brew "xpipe"
# Yet Another Dotfiles Manager
brew "yadm"
# Additional completion definitions for zsh
brew "zsh-completions"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Enable Windows-like alt-tab
cask "alt-tab"
# Data backup and storage service
cask "backblaze"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerised applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Development environment
cask "hashicorp-vagrant"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File system integration
cask "macfuse"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Warns about malware, adware and spyware
cask "malwarebytes"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Centralises all remote connections on a single platform
cask "remote-desktop-manager"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Open-source BitTorrent client
cask "transmission"
# Development environment
cask "vagrant"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Rust-based terminal
cask "warp"
# Network protocol analyzer
cask "wireshark"
mas "Bitwarden", id: 1352778147
mas "Microsoft Remote Desktop", id: 1295203466
mas "The Unarchiver", id: 425424353
mas "Wappalyzer - Technology profiler", id: 1520333300
vscode "codeium.codeium"
vscode "hashicorp.terraform"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
